Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: perl58delta and perl581delta have been added: these are the perldeltas of 5.8.0 and 5.8.1, detailing the differences respectively between 5.6.0 and 5.8.0, and between 5.8.0 and 5.8.1.
es_es: perl58delta y perl581delta han sido añadidos: estos son los perldeltas de 5.8.0 y 5.8.1, detallando las diferencias, respectivamente, entre 5.6.0 y 5.8.0, y entre 5.8.0 y 5.8.1.

source: You would have been able to just keep using Perl 5 with Parrot, the virtual machine which will compile and run Perl 6 bytecode.
es_es: Esto permitiría seguir utilizando Perl 5 con Parrot, la máquina virtual que compilará y ejecutará bytecode de Perl 6.

source: assigns the value of variable $bar to the scalar variable $foo.
es_es: asigna el valor de la variable $bar a la variable escalar $foo.

source: They fall into two major categories: list operators and named unary operators.
es_es: Se agrupan en dos categorías principales: operadores de listas y operadores unarios con nombre.

source: =head2 Core modules
es_es: =head2 Módulos integrados en el núcleo

source: (With 29 years to spare!)
es_es: (¡Con 28 años de sobra!)

source: Processing happens as you knew before.
es_es: El procesamiento se realiza igual que antes.

source: In any way, if you're seeing failures beyond those mentioned in this document, please consider upgrading to the latest Hurd before reporting the failure as a bug.
es_es: En cualquier caso, si ve más errores que los mencionados en este documento, debería actualizar a la versión más reciente de Hurd antes de notificar los errores.

source: C<Data::Dumper> upgraded to version 2.121_08
es_es: C<Data::Dumper> actualizado a la version 2.121_08

source: Although optimized for scanning text, Perl also has many excellent tools for slicing and dicing binary data.
es_es: Aunque está optimizado para el procesamiento de texto, Perl también tiene excelentes herramientas para extraer y cortar datos en binario.

source: Imagine you'd like to find a sequence of non-digits not followed by "123".
es_es: Imagínese que le gustaría encontrar una secuencia de no-dígitos que no esté seguido por "123".

source: Note also that the whole range idea is rather unportable between character sets--and even within character sets they may cause results you probably didn't expect.
es_es: Tenga en cuenta también que la idea de rango es poco transportable entre conjuntos de caracteres; e incluso dentro de los mismos conjuntos de caracteres pueden causar resultados que probablemente no espera.

source: =item open FILEHANDLE
es_es: =item open IDENTIFICADOR_ARCHIVO

source: Most tasks only require a small subset of the Perl language.
es_es: La mayoría de las tareas sólo requieren conocer un pequeño subconjunto del lenguaje Perl.

source: That will print out:
es_es: Esto imprimirá:

source: Your interfaces should be understandable by an average Perl programmer.
es_es: Su interfaz debe ser comprensible para un programador promedio de Perl.

source: The C<t/io/fflush> test fails at #6.
es_es: El test C<t/io/fflush> falla en el número 6.

source: by Joseph N. Hall, Joshua A. McAdams, brian d foy
es_es: Joseph N. Hall, Joshua A. McAdams, brian d foy

source: Notice the inner loop.
es_es: Observe el bucle interior.

source: Regarding aesthetics of code lay out, about the only thing Larry cares strongly about is that the closing curly bracket of a multi-line BLOCK should line up with the keyword that started the construct.
es_es: Con respecto a la estética del código, a lo único que Larry le preocupa es que la llave de cierre de un BLOQUE multilínea debe alinearse con la palabra reservada que inició esa estructura.

source: Perl parses it without error, but when you try to execute a whatever, it throws an exception with the text C<Unimplemented>:
es_es: Perl lo interpreta sin error, pero al intentar ejecutar un blablablá, produce una excepción con el texto C<Unimplemented>:

source: It is an error to try to write off the beginning of the string (i.e., negative OFFSET).
es_es: Es un error tratar de cancelar el principio de la cadena (es decir, DESPLAZAMIENTO negativo).

source: # then back the top to re-check EXPR
es_es: # entonces regresa arriba a recomprobar la EXPR

source: It would generate the scalar comma operator there, not the list construction version of the comma.
es_es: Se generará aquí el operador coma, no la versión de construcción de listas.

source: perl5115delta Perl changes in version 5.11.5
es_es: perl5115delta Cambios en la versión 5.11.5

source: If bits is 4 or less, the string is broken into bytes, then the bits of each byte are broken into 8/BITS groups.
es_es: Si bits son 4 o menos, la cadena se divide en bytes, y a continuación, los bits de cada byte se dividen en grupos de 8/BITS.

source: If you chop a list, each element is chopped.
es_es: Si recorta una lista, cada elemento es recortado.

source: say "a/b is ", $a/$b;
es_es: say "a/b es ", $a/$b;

source: "FooBar.pm provides an implementation of the FOO protocol and the related BAR standard."
es_es: "FooBar.pm proporciona una implementación del protocolo FOO y la norma BAR relacionada."

source: Returns true if successful, C<undef> on error.
es_es: Devuelve verdadero si tuvo éxito, C<undef> en caso de error.

source: This means that everything passes except for some problems in the packages "Math::BigInt", "Math::Complex", and "Math::Trig".
es_es: Esto significa que todo pasa a excepción de algunos problemas en los paquetes "Math::BigInt", "Math::Complex", y "Math::Trig".

source: Perl can internally represent numbers in 3 different ways: as native integers, as native floating point numbers, and as decimal strings.
es_es: Perl puede representar los números internamente de 3 maneras distintas: como enteros nativos, como números de punto flotante nativos y como cadenas decimales.

source: A synopsis of the common uses of the module
es_es: Una sinopsis de los usos comunes del módulo

source: X<\> X<reference> X<backslash>
es_es: X<\> X<reference> X<backslash> X<referencia> X<barra diagonal inversa>

source: (See also L<Integer Arithmetic> and L<Bitwise String Operators>.)
es_es: (Vea también L<Aritmética entera> y L<Operadores de bit en cadenas>).

source: Works only for non-negative operands unless you've loaded the C<Math::Complex> module.
es_es: Sólo funciona para operandos no negativos a menos que haya cargado el módulo C<Math::Complex>x.

source: No message is printed if there is a C<$SIG{__WARN__}> handler installed.
es_es: Ningún mensaje se imprime si hay instalado un controlador C<$SIG{__WARN__}>.

source: Saying C<undef $hash{$key}> will probably not do what you expect on most predefined variables or DBM list values, so don't do that; see L<delete>.
es_es: Decir C<undef $hash{$key}> probablemente no vaya a hacer lo que usted espera en la mayoría de las variables predefinidas o lista de valores DBM, así que no haga eso; vea L<delete>.

source: If both conversions are possible without loss of precision, and the operation can be performed without loss of precision then the integer result is used.
es_es: Si ambas conversiones son posibles sin pérdida de precisión y se puede realizar la operación sin pérdida de precisión, se usa el resultado entero.

source: Likewise C<\11> is a backreference only if at least 11 left parentheses have opened before it.
es_es: Asimismo, \11 es una contrareferencia sólo si, antes, y por lo menos, se han abierto 11 paréntesis.

source: If neither of the above default configs work on your platform, you might want to try
es_es: Si ninguna de las configuraciones por defecto funcionan en su plataforma, es posible que desee probar

source: C<\b> still means to match at the boundary between C<\w> and C<\W>, using the C</a> definitions of them (similarly for C<\B>).
es_es: C<\b> sigue coincidiendo en el límite entre C<\w> y C<\W>, usando las definiciones C</a> de ellos (lo mismo para C<\B>).

source: OPERATION is one of LOCK_SH, LOCK_EX, or LOCK_UN, possibly combined with LOCK_NB.
es_es: OPERACIÓN es una de LOCK_SH, LOCK_EX, o LOCK_UN, posiblemente combinado con LOCK_NB.

source: The old behaviour was that %tied_hash would return whatever would have been returned for that hash before the hash was tied (so usually 0).
es_es: El comportamiento anterior era que %hash_enlazado devolvería todo la que hubiera devuelto este hash antes de ser enlazado (por lo general, 0).

source: =head2 Basic BLOCKs X<block>
es_es: =head2 BLOQUES básicos X<block> X<bloque>

source: You can find out whether Perl considers "long double" to be the default floating-point size to use on your platform via L<Config>:
es_es: puede averiguar si Perl considera "long double" como el valor por defecto para el tamaño del punto flotante para su plataforma a través de L<Config>:

source: 'good men to come to.'
es_es: 'los hombres buenos por venir.'

source: for (@names) {
es_es: for (@nombres) {

source: $body = encode('UTF-8', $body);
es_es: $cuerpo_texto = encode('UTF-8', $cuerpo_texto);

source: Don't bother with -n32 unless you have 7.1 or later compilers (use cc -version to check).
es_es: No se moleste en poner -n32 a menos que tenga un compilador 7.1 o superior (use cc -version para comprobarlo)

source: =head2 Packaging
es_es: =head2 Empaquetado

source: g Match globally, i.e., find all occurrences.
es_es: g Coincidencia global, es decir, busca todas las ocurrencias.

source: The optimisation of C<for (reverse @a)> introduced in perl 5.8.6 could misbehave when the array had undefined elements and was used in LVALUE context.
es_es: La optimización de C<for (reverse @a)> introducido en perl 5.8.6 puede portarse mal cuando el array tuviera elementos indefinidos y fuera usado en contexto de IVALOR.

source: Sends a signal to a list of processes.
es_es: Manda una señal a una lista de procesos.

source: INSTALLATION ============
es_es: INSTALACIÓN ===========

source: =item qw/STRING/ X<qw> X<quote, list> X<quote, words>
es_es: =item qw/CADENA/ X<qw> X<quote, list> X<quote, words> X<entrecomillado, lista> X<entrecomillado, palabras>

source: See also L<perlipc/"SysV IPC"> and C<IPC::SysV> documentation.
es_es: Vea también la documentación de L<perlipc/"SysV IPC"> y C<IPC::SysV>.

source: Matches as C<S{min}|S{min+1}|...|S{max-1}|S{max}>.
es_es: Coincide con C<S{min}|S{min+1}|...|S{max-1}|S{max}>.

source: See L<perlsec/"Algorithmic Complexity Attacks"> for the original rationale behind this change.
es_es: Vea L<perlsec/"Ataques de complejidad algorítmica"> para la justificación original de este cambio.

source: a Use ASCII for \d, \s, \w; specifying two a's further restricts
es_es: a Usa ASCII para \d, \s, \w; con dos 'a' se restringe aún mas la

source: %hdrs = (UNIX_FROM => split /^(\S*?):\s*/m, $header);
es_es: %cabeceras = (UNIX_FROM => split /^(\S*?):\s*/m, $encabezado);

source: # same thing, but with explicit sort routine
es_es: # lo mismo, pero con una rutina de ordenación explícita

source: When the implementation of system components is likely to change over time (and hence should be encapsulated)
es_es: Cuando la implementación de los componentes del sistema es probable que cambie con el tiempo (y por lo tanto debe ser encapsulado)

source: Mac OS X now builds Perl statically by default.
es_es: Mac OS X ahora por defecto compila Perl de forma estática.

source: How it behaves depends on the context.
es_es: El cómo se comporta depende del contexto.

source: So if the beginning of a pattern containing a quantifier succeeds in a way that causes later parts in the pattern to fail, the matching engine backs up and recalculates the beginning part--that's why it's called backtracking.
es_es: Así que, si al principio de un patrón conteniendo un cuantificador logra de alguna manera que las últimas partes del patrón fallen, el motor retrocede y vuelve a recalcular la parte inicial -es por eso por lo que se llama vuelta atrás.

source: Whenever you make use of something that works only in some given release of Perl and later, but not earlier, you should place a prominent
es_es: Siempre que haga uso de algo que sólo funciona en algunas versiones de Perl y superiores, pero no antes, se debe colocar un prominente

source: The following (inefficiently) deletes all the values of %HASH and @ARRAY:
es_es: Lo siguiente borra (ineficientemente) todos los valores de %HASH y @ARRAY:

source: Children's times are only included for terminated children.
es_es: Los tiempos de los hijos solo se incluyen de los hijos terminados.

source: =head1 Numeric operators and numeric conversions
es_es: =head1 Operadores numéricos y conversiones numéricas

source: print $y; # prints "bar"
es_es: print $y; # imprime "bar" en pantalla

source: If, however, the string begins with a non-alphabetic character (excluding "+" or "-"), Perl will attempt to convert the string to a numeric and the arithmetic negation is performed.
es_es: Sin embargo, si la cadena comienza con un carácter no-alfabético (con exclusión de "+" o "-"), Perl tratará de convertir la cadena en un código numérico y se lleva a cabo la negación aritmética.

source: Note the I<characters>: depending on the status of the socket, either (8-bit) bytes or characters are sent.
es_es: Note los I<caracteres>: dependiendo del estado del socket, son enviados bytes (8-bit) o caracteres.

source: print FH $data or die "Can't write to FH: $!";
es_es: print FH $dato or die "No puedo escribir a FH: $!";

source: Note that a format typically does one C<formline> per line of form, but the C<formline> function itself doesn't care how many newlines are embedded in the PICTURE.
es_es: Note que un formato típicamente hace un C<formline> por línea del formato, pero a la misma función C<formline> no le preocupa cuántos avances de línea están incluidos en el CUADRO.

source: =item package NAMESPACE VERSION X<package> X<module> X<namespace> X<version>
es_es: =item package ESPACIO_NOMBRES VERSIÓN X<package> X<module> X<namespace> X<version> X<paquete> X<módulo> X<espacio de nombres> X<versión>

source: =item exp EXPR X<exp> X<exponential> X<antilog> X<antilogarithm> X<e>
es_es: =item exp EXPR X<exp> X<exponential> X<antilog> X<antilogarithm> X<e> X<exponencial> X<anti logaritmo>

source: #... # print stuff to output
es_es: #... # imprimir a la salida

source: Magazines that frequently carry quality articles on Perl include I<The Perl Review> ( http://www.theperlreview.com ), I<Unix Review> ( http://www.unixreview.com/ ), I<Linux Magazine> ( http://www.linuxmagazine.com/ ), and Usenix's newsletter/magazine to its members, I<login:> ( http://www.usenix.org/ ).
es_es: Las revistas que suelen publicar artículos de calidad sobre Perl son I<The Perl Review> ( http://www.theperlreview.com ), I<Unix Review> ( http://www.unixreview.com/ ), I<Linux Magazine> ( http://www.linuxmagazine.com/ ) y la revista/boletín de noticias para los miembros de Usenix, I<login:> ( http://www.usenix.org/ ).

source: Don't use slash as a delimiter when your regexp has slashes or backslashes.
es_es: No use barras inclinadas como delimitador cuando en su expresión regular tenga barras o contrabarras inclinadas.

source: But by saying
es_es: Pero al decir

source: Some support for DTrace has been added.
es_es: Se ha añadido algún soporte para DTrace.

source: comp.lang.perl.announce Moderated announcement group
es_es: comp.lang.perl.announce Grupo de anuncios moderado

source: =item C<(?&NAME)> X<(?&NAME)>
es_es: =item C<(?&NOMBRE)> X<(?&NOMBRE)>

source: On FreeBSD the full path of the perl interpreter is found by reading the symlink F</proc/curproc/file>.
es_es: En FreeBSD el camino completo del intérprete perl se encuentra leyendo el enlace simbólico F</proc/curproc/file>.

source: =item stat DIRHANDLE
es_es: =item stat IDENTIFICADOR_DIR

source: If "'" is used as the delimiter, no interpolation is done.
es_es: Si se usa "'" como delimitador, no se realiza ninguna interpolación.

source: There is a binary version of perl available from L<http://www.cp15.org/perl/> which you may wish to use instead of trying to compile it yourself.
es_es: Hay una versión binaria de perl disponible en L<http://www.cp15.org/perl/> que es posible que desee utilizar en lugar de tratar de compilarlo usted mismo.

source: What does it mean?
es_es: ¿Qué es lo que significa?

source: Each of the methods works identically, and is used to install (or uninstall) a single DBM Filter.
es_es: Todos los métodos funcionan de la misma manera y se usan para instalar (o desinstalar) un filtro DBM individual.

source: printf '<%.6d>', 1; # prints "<000001>"
es_es: printf '<%.6d>', 1; # imprime "<000001>"

source: (See L<perlsyn/"Compound Statements">.) X<$+> X<$^N> X<$&> X<$`> X<$'> X<$1> X<$2> X<$3> X<$4> X<$5> X<$6> X<$7> X<$8> X<$9>
es_es: (Vea L<perlsyn/"Instrucciones compuestas">.) X<$+> X<$^N> X<$&> X<$`> X<$'> X<$1> X<$2> X<$3> X<$4> X<$5> X<$6> X<$7> X<$8> X<$9>

source: The second version didn't; it tried to run a program named I<"echo surprise">, didn't find it, and set C<$?> to a non-zero value indicating failure.
es_es: La segunda versión no; intentó ejecutar un programa llamado literalmente I<"echo sorpresa">, no lo encontró, y puso C<$?> a un valor distinto de cero para indicar un error.

source: Lengthening an array that was previously shortened does not recover values that were in those elements.
es_es: Alargar un array que ha sido acortado previamente no permite recuperar los valores que había en esos elementos.

source: For floating-point formats except C<g> and C<G>, this specifies how many places right of the decimal point to show (the default being 6).
es_es: Para formatos en punto flotante excepto C<g> y C<G>, especifica cuántos lugares a la derecha del punto decimal debe mostrar (el valor predeterminado es 6).

source: The result is unpredictable and will make perl unstable.
es_es: El resultado es impredecible y hará a perl inestable.

source: If the variable is preceded with the keyword C<my>, then it is lexically scoped, and is therefore visible only within the loop.
es_es: Si la variable es precedida por la palabra clave C<my>, entonces su ámbito es léxicamente local y por eso es visible sólo dentro del bucle.

source: Generally used in a C<continue> block at the end of a loop to clear variables and reset C<??> searches so that they work again.
es_es: Generalmente se usa en un bloque C<continue>, al final de un bucle para limpiar variables y reinicializar las búsquedas C<??>, para que funcionen de nuevo.

source: Its argument will be taken from the next line.
es_es: Su argumento se tomará de la línea siguiente.

source: The Apple-provided Perl is still dynamically linked and shared, and you can enable the sharedness for your own Perl builds by C<Configure -Duseshrplib>.
es_es: El Perl proporcionado por Apple sigue siendo enlazado de forma dinámica y compartida, y se puede habilitar el nivel de compartición de su propia compilación de Perl por medio de C<Configure -Duseshrplib>.

source: Previously when running with warnings enabled globally via C<-w>, selective disabling of specific warning categories would actually turn off all warnings.
es_es: Anteriormente, cuando se ejecutaba con las advertencias habilitadas a nivel global a través de C<-w>, una desactivación selectiva de categorías de advertencias específicas podría, realmente, desactivar todas las advertencias.

source: Then you know exactly how many bytes it will be in the destination string.
es_es: Así podrá saber exactamente cuántos bytes hay en la cadena generada.

source: As you would expect, this modifier causes, for example, C<\D> to mean the same thing as C<[^0-9]>; in fact, all non-ASCII characters match C<\D>, C<\S>, and C<\W>.
es_es: Como era de esperar, esto hace que el modificador, por ejemplo, C<\D> quiera decir lo mismo que C<[^ 0-9]>; de hecho, todos los caracteres no ASCII coinciden con C<\D>, C<\S> y C<\W>.

source: The C<h2xs> utility now produces a more modern layout: F<Foo-Bar/lib/Foo/Bar.pm> instead of F<Foo/Bar/Bar.pm>.
es_es: La utilidad C<h2xs> produce ahora un diseño más moderno: F<Foo-Bar/lib/Foo/Bar.pm> en lugar de F<Foo/Bar/Bar.pm>.

source: C<mro> is now implemented as an XS extension.
es_es: C<mro> está ahora implementado como una extensión XS.

source: For example, this is applicable to C<printf "%s", $value>.
es_es: Por ejemplo, esto es aplicable a C<printf "%s", $valor>.

source: Longer-than-32-character filenames are now supported on OpenVOS, and build properly without IPv6 support.
es_es: Nombre de archivo Longer-than-32-character ahora están soportados en OpenVOS, y se construye apropiadamente sin soporte IPv6.

source: =item open FILEHANDLE,MODE,REFERENCE
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,REFERENCIA

source: It's true if one element in @array verifies C<$scalar ~~ $element>.
es_es: Es cierto si un elemento de @array verifica que C<$scalar ~~ $elemento>.

source: my ($filename) = @_;
es_es: my ($nombrearchivo) = @_;

source: banana => "yellow",
es_es: plátano => "amarillo",

source: Files passed on the command line are filtered by default
es_es: Los archivos pasados en la línea de comandos son, por defecto, filtrados

source: $tY = sprintf("%.${POINTS}g", $Y);
es_es: $tY = sprintf("%.${PUNTOS}g", $Y);

source: directive at the top of the file that needs it.
es_es: directiva en la parte superior del archivo que lo necesite.

source: (I<"Rounding to zero".>)
es_es: (I<"Redondeo a cero">)

source: If three (or more) arguments are specified, the open mode (including optional encoding) in the second argument are distinct from the filename in the third.
es_es: Si se especifican tres (o más) argumentos, es tomado el modo de apertura (incluyendo un codificado opcional) del segundo argumento, a diferencia del nombre del archivo, que estará en el tercer argumento.

source: Instead, you have to roll yourself a loop or two.
es_es: En su lugar, tiene que hacer un bucle o dos.

source: These strengths make it especially popular with system administrators and CGI script authors, but mathematicians, geneticists, journalists, and even managers also use Perl.
es_es: Por estas cualidades es muy popular entre los administradores de sistemas y los programadores de scripts CGI, pero también lo usan matemáticos, expertos en ingeniería genética, periodistas e incluso directivos.

source: perl5110delta - what is new for perl v5.11.0
es_es: perl5110delta - qué hay de nuevo en perl v5.11.0

source: but
es_es: pero

source: Perl 5.8.4 introduced a change so that assignments of C<undef> to a scalar, or of an empty list to an array or a hash, were optimised away.
es_es: Perl 5.8.4 introducía un cambio para que las asignaciones de C<undef> a un escalar, o de una lista vacía a un array o un hash, fueran optimizadas.

source: Choose an appropriate license (GPL/Artistic is a good default)
es_es: Elija una licencia adecuada (GPL/Artística es un buen valor por defecto)

source: =head2 Defined-or operators
es_es: =head2 Operadores definido-o

source: At each position of the string the best match given by non-greedy C<??> is the zero-length match, and the I<second best> match is what is matched by C<\w>.
es_es: En cada posición de la cadena, la mejor opción dada por el modificador no codicioso C<??> es la coincidencia de longitud cero, y la I<segunda mejor> coincidencia es la que se corresponde con C<\w>.

source: Tests for perl's built in functions that don't fit into any of the other directories.
es_es: Pruebas de funciones integradas de perl que no se corresponden con ninguno de los demás directorios.

source: Currently, C<given> blocks can't always be used as proper expressions.
es_es: En la actualidad, los bloques C<given> no siempre se pueden utilizar como expresiones individuales.
